# DBeam_GetLines2FOff

## Description
Return the most recently created beam object

```pascal
FUNCTION DBeam_GetLines2FOff : HANDLE;
```

```python
def vs.DBeam_GetLines2FOff():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight